Группа_1С/src/InformationRegisters/ВыполняемыеОперацииСИнформационнымиБазами/ВыполняемыеОперацииСИнформационнымиБазами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВыполняемыеОперацииСИнформационнымиБазами</name>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Операция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Группа_1С/src/InformationRegisters/ВыполняемыеОперацииСИнформационнымиБазами/ManagerModule.bsl
Процедура УстановитьВыполнениеОперации(ИнформационнаяБаза, ВыполняемаяОперация) Экспорт 

	МенеджерЗаписи = РегистрыСведений.ВыполняемыеОперацииСИнформационнымиБазами.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ИнформационнаяБаза = ИнформационнаяБаза;
	МенеджерЗаписи.Прочитать();
	Если НЕ МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.ИнформационнаяБаза = ИнформационнаяБаза;
		МенеджерЗаписи.Операция = ВыполняемаяОперация;
		МенеджерЗаписи.Записать();
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьЗавершениеВыполненияОперации(ИнформационнаяБаза, ВыполняемаяОперация) Экспорт 
	НаборЗаписей = РегистрыСведений.ВыполняемыеОперацииСИнформационнымиБазами.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИнформационнаяБаза.Установить(ИнформационнаяБаза);
	НаборЗаписей.Отбор.Операция.Установить(ВыполняемаяОперация);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
КонецПроцедуры
